In [3]:
#pandas is data manipulation library
# tabular/excel type of data
# columns and rows 

#why pandas and not numpy ?
# pandas can store numeric and strings also 
# pandas is built on top of numpy

#all the internet data is available in json only
# and json is dictionary in python
import pandas as pd

In [ ]:
# problems in numpy


# excel has hetergogenous
# column names nhi hote numpy  mein

# data is csv(comma seperated values)
#

In [6]:
import numpy as np
np.arange(0,9).reshape(3,3)
#there is no way we can add these columns names of this array

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [8]:
{
    {"name": "python",
    "age": 11}, 
    
    {"name": "mayank",
     "age" : 12}
}

TypeError: unhashable type: 'dict'

In [7]:
{"name": "nikita", "age": 13}

{'name': 'nikita', 'age': 13}

In [9]:
# 1. pandas is a open source(can see the code) and free library
# 2. easy for data structure and analysis
# 3. high performance

# Types of Data Structure in pandas

1. series                 - 1diemnsional  - 1-d labelled, homogenous size and immutable in nature.
2. dataframe              - 2 dimensional  - 2-d labelled, heterogenours  , size:mutable
3. panel (not used mainly) - 3 dimensional - 3d labelled, mutable

# PANDAS DATAFRAME
2-dimeniosnal labelled and mutable data structure which stores data in form of rows and columns.

In [13]:
data = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
data #there is no concept of multiple sheets of csv - it can only have one sheet

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [14]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [19]:
# Features in pandas- analgolus to tabular data
# can perfomr arithmetic operations
# is mutable (changes can be made inside it.)
# labelled.
# it has rows and columns and inside it it has element/value/entity
# column is called header

In [18]:
print(data[data['PassengerId'] == 5]['Name'])

4    Allen, Mr. William Henry
Name: Name, dtype: object

In [16]:
data['PassengerId'] == 5

0      False
1      False
2      False
3      False
4       True
       ...
886    False
887    False
888    False
889    False
890    False
Name: PassengerId, Length: 891, dtype: bool

In [22]:
pd.DataFrame([1,2,3],columns = ["my first column"]) #provided this list to the dataframe

   my first column
0                1
1                2
2                3

In [26]:
#give names to rows as well
# index is for giving the names of the rows. 

pd.DataFrame([1,2,3],columns = ["my first column"],index= ["row1","row2","row3"])

      my first column
row1                1
row2                2
row3                3

In [28]:
pd.DataFrame({ "col1": [1,2], "col2":[3,4]},index = ["r1","r2"])

    col1  col2
r1     1     3
r2     2     4

In [33]:
# columns needs to be given in a collection only 
# it selects that particular column,
# coz column name toh already de diya hai na.

#in dictionary it selects on the basis of which columns one wants to select on.
pd.DataFrame({"col1": [1,2,3],"col2": [3,4,5]}, index = ["r1","r2","r3"], columns = ["col2","col1"])

    col2  col1
r1     3     1
r2     4     2
r3     5     3

In [34]:
# can even give a new column with no values
pd.DataFrame({"col1": [1,2], "col2":[3,4]},index = ["r1","r2"], columns = ["col0"])

   col0
r1  NaN
r2  NaN

In [35]:
import os
os.getcwd()

'c:\\pvt\\Ineuron\\Python\\Libraries\\PANDAS'

# functions

# importing data to pandas
# headers are just headers - its not part of the data.

In [37]:
titanic= pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [38]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [42]:
#header = None doesnt give the names of the columns at all.

pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv",header = None)

,0,1,2,3,4,5,6,7,8,9,10,11
0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,NaN,S
2,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
3,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,NaN,S
4,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,C123,S
...,...,...,...,...,...,...,...,...,...,...,...,...
887,887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13,NaN,S
888,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30,B42,S
889,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
890,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30,C148,C
891,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.75,NaN,Q

In [43]:
type(titanic)

pandas.core.frame.DataFrame

In [ ]:
titanic.to_csv("titanic_dataset.csv")

In [ ]:
titanic.to_json("tittani.json")

In [ ]:
titanic_from_json = pd.read_json("titanic.json")

In [45]:
titanic_cut = titanic.iloc[0:2] #extracts 0,1 rows only - index means rows so extracts rows only.
titanic_cut

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [46]:
titanic_cut.to_json("titanic_cut.json")

In [ ]:
pd.read_sql()

In [21]:
pd.DataFrame((1,2,3))

   0
0  1
1  2
2  3